src/Infra/xml/yanbal/cancelPayment/reqCancelPayment.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:to="http://to.ercdrpt.ws.corp.yanbal.com" xmlns:to1="http://to.comun.ws.corp.yanbal.com" xmlns:to2="http://to.entity.ws.corp.yanbal.com">
   <soapenv:Header/>
   <soapenv:Body>
      <to:eliminarRecaudoRequest>
         <to:integracionWSReq>
            <to:cabecera>
               <to1:codigoInterfaz>ERCDRPT</to1:codigoInterfaz>
               <to1:usuarioAplicacion>param_usuarioAplicacion</to1:usuarioAplicacion>
               <to1:codigoAplicacion>STS</to1:codigoAplicacion>
               <to1:codigoPais>BO</to1:codigoPais>
               <to1:codigosPaisOD>
                  <to1:codigoPaisOD>
                     <to1:valor>BO</to1:valor>
                  </to1:codigoPaisOD>
               </to1:codigosPaisOD>
            </to:cabecera>
            <detalle>
               <to:parametros>
                  <to2:idBanco>param_idBanco</to2:idBanco>
                  <to2:idToken></to2:idToken>
                  <to2:consultora>
                     <to2:codConsultora>param_codConsultora</to2:codConsultora>
                     <to2:tipoDocumento>param_tipoDocumento</to2:tipoDocumento>
                     <to2:numDocumento>param_numDocumento</to2:numDocumento>
                  </to2:consultora>
                  <to2:recaudo>
                     <to2:fecTransaccion>param_fecTransaccion</to2:fecTransaccion>
                     <to2:numCuenta>param_numCuenta</to2:numCuenta>
                     <to2:numOperacion>param_numOperacion</to2:numOperacion>
                     <to2:canalRecaudo>param_canalRecaudo</to2:canalRecaudo>
                     <to2:montoRecaudo>param_montoRecaudo</to2:montoRecaudo>
                     <to2:codMoneda>param_codMoneda</to2:codMoneda>
                  </to2:recaudo>
               </to:parametros>
            </detalle>
         </to:integracionWSReq>
      </to:eliminarRecaudoRequest>
   </soapenv:Body>
</soapenv:Envelope>